#+PROPERTY:  header-args :session *R* :tangle ../docs/R/choropleth.R :eval no-export
#+OPTIONS: ^:nil
#+BIND: org-latex-image-default-height  "0.45\\textheight"

#+begin_src R :exports none :tangle no
setwd('~/github/bookvis/')
#+end_src


#+begin_src R :exports none  
##################################################################
## Initial configuration
##################################################################
## Clone or download the repository and set the working directory
## with setwd to the folder where the repository is located.
  
library(lattice)
library(ggplot2)
library(latticeExtra)
  
myTheme <- custom.theme.2(pch = 19, cex = 0.7,
                          region = rev(brewer.pal(9, 'YlOrRd')),
                          symbol = brewer.pal(n = 8, name = "Dark2"))
myTheme$strip.background$col='transparent'
myTheme$strip.shingle$col='transparent'
myTheme$strip.border$col='transparent'

xscale.components.custom <- function(...)
{
    ans <- xscale.components.default(...)
    ans$top = FALSE
    ans
}

yscale.components.custom <- function(...)
{
    ans <- yscale.components.default(...)
    ans$right = FALSE
    ans
}

myArgs <- list(as.table = TRUE,
               between = list(x = 0.5, y = 0.2),
               xscale.components = xscale.components.custom,
               yscale.components = yscale.components.custom)

defaultArgs <- lattice.options()$default.args


lattice.options(default.theme = myTheme,
                default.args = modifyList(defaultArgs, myArgs))
  
#+end_src


* Choropleth Maps
\label{sec:multiChoropleth}
#+begin_src R :exports none
##################################################################
## Choropleth maps
##################################################################
#+end_src

A choropleth map shades regions according to the measurement of a
variable displayed on the map. The choropleth map is an appropriate
tool to visualize a variable uniformly distributed within each region,
changing only at the region boundaries. This method performs correctly
with homogeneous regions, both in size and shape.

This section details how to create choropleth maps depicting the
results of the 2016 Spanish general elections. The section
ref:sec:dataChoropleth describes how to define a
=SpatialPolygonsDataFrame= combining the data from a =data.frame= and
the spatial information of the administrative boundaries from a
shapefile. The result is stored in the =data= folder, in a set of
files named =spMapVotes.*=. You can visit it for details if you are
interested in this procedure.

#+begin_src R 
library(sp)
library(maptools)

spMapVotes <- readShapePoly(fn = "data/spMapVotes", 
                        proj4string = CRS("+proj=utm +zone=30 +ellps=GRS80 +units=m +no_defs"))
#+end_src

This =SpatialPolygonsDataFrame= contains two main variables:
=whichMax=, the name of the predominant political option, and =pcMax=,
the percentage of votes obtained by this political option.

#+begin_src R :results output :exports results :tangle no
summary(spMapVotes)
#+end_src

#+RESULTS:
#+begin_example
Object of class SpatialPolygonsDataFrame
Coordinates:
      min     max
x  -13952 1127057
y 3903525 4859444
Is projected: TRUE 
proj4string :
[+proj=utm +zone=30 +ellps=GRS80 +units=m +no_defs]
Data attributes:
    PROVMUN     whichMax         Max               pcMax      
 01001  :   1   ABS :2812   Min.   :     2.0   Min.   :21.33  
 01002  :   1   C.s :   3   1st Qu.:    54.0   1st Qu.:31.68  
 01003  :   1   OTH : 170   Median :   162.0   Median :35.64  
 01004  :   1   PP  :4212   Mean   :  1395.9   Mean   :37.58  
 01006  :   1   PSOE: 776   3rd Qu.:   636.5   3rd Qu.:41.27  
 01008  :   1   UP  : 137   Max.   :696804.0   Max.   :94.74  
 (Other):8104
#+end_example

As a visual aid, the subsequent maps will be produced with the
province boundaries superposed. These boundaries are encoded in the
=spain_provinces= shapefile. The =spplot= function that will generate
the maps, offers the argument =sp.layout= to add additional layers to
the map[fn:2]. This argument should be a list: its first element is the
function to display the layer, the second element is the object to be
represented, and the rest of elements are arguments to the function
defined in the first element.

#+INDEX: sp.layout\texttt{sp.layout}

#+begin_src R
provinces <- readShapePoly(fn="data/spain_provinces",
                        proj4string = CRS("+proj=utm +zone=30 +ellps=GRS80 +units=m +no_defs"))

provinceLines <- list("sp.polygons", provinces, lwd = 0.1)
#+end_src

** Qualitative variable

On the other hand, =whichMax= is a categorical value with four levels:
the main parties (=PP=, =PSOE=, =UP=, =Cs=), the abstention results
(=ABS=), and the rest of the parties (=OTH=). 

#+begin_src R :results output :exports results :tangle no
table(spMapVotes$whichMax)
#+end_src

#+RESULTS:
| ABS  | 2812 |
| C.s  |    3 |
| OTH  |  170 |
| PP   | 4212 |
| PSOE |  776 |
| UP   |  137 |

Figure [[fig:whichMax]] encodes these levels with a qualitative palette from ColorBrewer.

#+INDEX: Packages!RColorBrewer\texttt{RColorBrewer}
#+INDEX: brewer.pal\texttt{brewer.pal}

#+begin_src R 
classes <- levels(factor(spMapVotes$whichMax))
nClasses <- length(classes)

qualPal <- brewer.pal(nClasses, "Dark2")
#+end_src


#+begin_src R :results output graphics :exports both :file figs/whichMax.pdf
spplot(spMapVotes["whichMax"],
       col.regions = qualPal,
       col = 'transparent',
       sp.layout = provinceLines)
#+end_src

#+CAPTION: Categorical choropleth map displaying the name of the predominant political option in each municipality in the 2016 Spanish general elections.
#+LABEL: fig:whichMax
#+RESULTS:
[[file:figs/whichMax.pdf]]

